Repository: rraptorr/oracle-java7
Catalog: debian/po/*.po
Languages: es

source: JCE Unlimited Strength Jurisdiction Policy Files
es: Archivos de directrices jurisdiccionales de fuerza ilimitada JCE

source: Due to import control restrictions of some countries, the JCE jurisdiction policy files shipped with this package allow "strong" but limited cryptography to be used. An "unlimited strength" version of these files indicating no restrictions on cryptographic strengths is available for those living in eligible countries (which is most countries). You download this version and replace the strong cryptography versions supplied with this package with the unlimited ones.
es: Debido al control de restricciones de importaciones de algunos países, los archivos de las directrices jurisdiccionales de JCE que se entregan con este paquete permite que se use «criptografía fuerte», pero limitada. Una versión con «fuerza ilimitada» de estos archivos, sin restricciones en la fuerza criptográfica, está disponible para países aptos (que son la mayoría). Descargue esta versión y reemplace las versiones de «criptografía fuerte» proporcionadas con este paquete por las ilimitadas.

source: The Java(TM) Cryptography Extension (JCE) Unlimited Strength Jurisdiction Policy Files 1.4.2 are available at http://javashoplm.sun.com/ECom/docs/Welcome.jsp?StoreId=22&PartDetailId=7503-jce-1.4.2-oth-JPR&SiteId=JSC&TransactionId=noreg
es: Los archivos de política jurisdiccional de fuerza ilimitada de la versión 1.4.2 de la Extensión Criptográfica Java(TM) (JCE) están disponibles en «http://javashoplm.sun.com/ECom/docs/Welcome.jsp?StoreId=22&PartDetailId=7503-jce-1.4.2-oth-JPR&SiteId=JSC&TransactionId=noreg»

source: Grant the "stopThread" RuntimePermission?
es: ¿Otorgar los permisos para ejecutar «stopThread»?

source: This permission allows any thread to stop itself using the java.lang.Thread.stop() method that takes no argument.
es: Estos permisos permiten a cualquier hilo detenerse por sí mismo usando el método «java.lang.Thread.stop()», que no lleva argumentos.

source: Note that this permission is granted by default only to remain backwards compatible. It is strongly recommended that you either not grant this permission at all or restrict it manually in java.policy to code sources that you specify, because Thread.stop() is potentially unsafe.
es: Tenga en cuenta que estos permisos se otorgan por omisión, sólo para permanecer compatible con versiones anteriores. Se recomienda encarecidamente que no otorgue estos permisos a todos, o que los restrinja manualmente en «java.policy» en el código fuente que especifique, ya que el método «Thread.stop()» es potencialmente inseguro.

source: See "http://java.sun.com/notes" for more information.
es: Para más información vaya a «http://java.sun.com/notes».

source: Do you accept the DLJ license terms?
es: ¿Está de acuerdo con los términos de la licencia «DLJ»?

source: In order to install this package, you must accept the license terms, the "Operating System Distributor License for Java" (DLJ), v1.1. Not accepting will cancel the installation.
es: Para instalar este paquete debe aceptar los términos de la licencia «Operating System Distributor License for Java» (DLJ), v1.1. Si no acepta se cancelará la instalación.

source: Declined Operating System Distributor License for Java v1.1 (DLJ)
es: Declinada la «Operating System Distributor License for Java» versión v1.1 (DLJ)

source: If you do not agree to the DLJ license terms you cannot install this software.
es: Si no está de acuerdo con los términos de la licencia «DLJ», no puede instalar este software.

source: The installation of this package will be canceled.
es: Se ha cancelado la instalación de este paquete.
